; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v4 ?v12)
             (pred_11 ?v10 ?v11)
             (pred_4 ?v4 ?v11)
             (pred_1 ?v9 ?v4 )
	     (pred_6 ?v4)
             (pred_9 ?v2)
             (pred_10 ?v10)
             (pred_3 ?v11)
             (pred_7 ?v4)
             (pred_2 ?v10)
             (pred_5 ?v4)
             (pred_12 ))



(:action op_3
:parameters (?v1 ?v5 ?v13 ?v3)
:precondition (and (pred_9 ?v1) (pred_9 ?v5) (pred_10 ?v13) (pred_3 ?v3)
          (pred_8 ?v1 ?v5) (pred_11 ?v13 ?v3)
                   (pred_4 ?v5 ?v3) (pred_6 ?v1) 
                   (pred_7 ?v5) (pred_2 ?v13))
:effect (and  (pred_5 ?v5) (not (pred_7 ?v5))))


(:action op_1
:parameters (?v1 ?v8)
:precondition (and (pred_9 ?v1) (pred_9 ?v8)
               (pred_6 ?v1) (pred_8 ?v1 ?v8) (pred_5 ?v8))
:effect (and (pred_6 ?v8) (not (pred_6 ?v1))))

(:action op_5
:parameters (?v1 ?v13)
:precondition (and (pred_9 ?v1) (pred_10 ?v13) 
                  (pred_6 ?v1) (pred_1 ?v13 ?v1) (pred_12 ))
:effect (and (pred_2 ?v13)
   (not (pred_1 ?v13 ?v1)) (not (pred_12 ))))


(:action op_4
:parameters (?v1 ?v6 ?v7)
:precondition (and (pred_9 ?v1) (pred_10 ?v6) (pred_10 ?v7)
                  (pred_6 ?v1) (pred_2 ?v7) (pred_1 ?v6 ?v1))
:effect (and (pred_2 ?v6) (pred_1 ?v7 ?v1)
        (not (pred_2 ?v7)) (not (pred_1 ?v6 ?v1))))

(:action op_2
:parameters (?v1 ?v13)
:precondition (and (pred_9 ?v1) (pred_10 ?v13) 
                  (pred_6 ?v1) (pred_2 ?v13))
:effect (and (pred_12 ) (pred_1 ?v13 ?v1) (not (pred_2 ?v13)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_04 obj_09 obj_08 obj_12 obj_10 obj_06 obj_01 obj_02 obj_13
    obj_05 obj_03
    obj_07 obj_11
    )

    (:init
       (pred_12)

       (pred_9 obj_04)
       (pred_9 obj_09)
       (pred_9 obj_08)
       (pred_9 obj_12)
       (pred_9 obj_10)
       (pred_9 obj_06)
       (pred_9 obj_01)
       (pred_9 obj_02)
       (pred_9 obj_13)
       (pred_3 obj_05)
       (pred_3 obj_03)
       (pred_10 obj_07)
       (pred_10 obj_11)

       (pred_8 obj_04 obj_12)
       (pred_8 obj_04 obj_09)
       (pred_8 obj_09 obj_10)
       (pred_8 obj_09 obj_08)
       (pred_8 obj_09 obj_04)
       (pred_8 obj_08 obj_06)
       (pred_8 obj_08 obj_09)
       (pred_8 obj_12 obj_01)
       (pred_8 obj_12 obj_10)
       (pred_8 obj_12 obj_04)
       (pred_8 obj_10 obj_02)
       (pred_8 obj_10 obj_06)
       (pred_8 obj_10 obj_09)
       (pred_8 obj_10 obj_12)
       (pred_8 obj_06 obj_13)
       (pred_8 obj_06 obj_08)
       (pred_8 obj_06 obj_10)
       (pred_8 obj_01 obj_02)
       (pred_8 obj_01 obj_12)
       (pred_8 obj_02 obj_13)
       (pred_8 obj_02 obj_10)
       (pred_8 obj_02 obj_01)
       (pred_8 obj_13 obj_06)
       (pred_8 obj_13 obj_02)
       (pred_7 obj_08)
       (pred_7 obj_06)
       (pred_4  obj_08 obj_05)
       (pred_4  obj_06 obj_03)
       (pred_5 obj_04)
       (pred_5 obj_09)
       (pred_5 obj_12)
       (pred_5 obj_10)
       (pred_5 obj_01)
       (pred_5 obj_02)
       (pred_5 obj_13)

       (pred_11  obj_07 obj_05)
       (pred_11  obj_11 obj_03)
       (pred_1 obj_07 obj_01)
       (pred_1 obj_11 obj_04)
       (pred_6 obj_04)
    )

    (:goal (and
       (pred_1 obj_07 obj_09)
    ))
(:constraints
  (always (not (pred_6 obj_12)))
)
)

; plan
1. (op_5 obj_04 obj_11)
   deleted: (pred_1 obj_11 obj_04) (pred_12)
   added: (pred_2 obj_11)
   goals met: 0 of 1
2. (op_1 obj_04 obj_09)
   deleted: (pred_6 obj_04)
   added: (pred_6 obj_09)
   goals met: 0 of 1
3. (op_2 obj_09 obj_11)
   deleted: (pred_2 obj_11)
   added: (pred_12) (pred_1 obj_11 obj_09)
   goals met: 0 of 1
4. (op_1 obj_09 obj_10)
   deleted: (pred_6 obj_09)
   added: (pred_6 obj_10)
   goals met: 0 of 1
5. (op_1 obj_10 obj_02)
   deleted: (pred_6 obj_10)
   added: (pred_6 obj_02)
   goals met: 0 of 1
6. (op_1 obj_02 obj_01)
   deleted: (pred_6 obj_02)
   added: (pred_6 obj_01)
   goals met: 0 of 1
7. (op_5 obj_01 obj_07)
   deleted: (pred_1 obj_07 obj_01) (pred_12)
   added: (pred_2 obj_07)
   goals met: 0 of 1
8. (op_1 obj_01 obj_02)
   deleted: (pred_6 obj_01)
   added: (pred_6 obj_02)
   goals met: 0 of 1
9. (op_1 obj_02 obj_10)
   deleted: (pred_6 obj_02)
   added: (pred_6 obj_10)
   goals met: 0 of 1
10. (op_1 obj_10 obj_09)
   deleted: (pred_6 obj_10)
   added: (pred_6 obj_09)
   goals met: 0 of 1
11. (op_4 obj_09 obj_11 obj_07)
   deleted: (pred_2 obj_07) (pred_1 obj_11 obj_09)
   added: (pred_2 obj_11) (pred_1 obj_07 obj_09)
   goals met: 1 of 1
